src/gatling/resources/data/Soap_request_0001.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.wizards.com/Service/2013-03">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:Login>
         <!--Optional:-->
         <ns:request>
            <!--Optional:-->
            <ns:ClientDetails>
               <ns:ClientIdentifier>?</ns:ClientIdentifier>
               <!--Optional:-->
               <ns:ClientVersion>?</ns:ClientVersion>
               <!--Optional:-->
               <ns:OsVersion>?</ns:OsVersion>
               <!--Optional:-->
               <ns:ProcessorArchitecture>?</ns:ProcessorArchitecture>
            </ns:ClientDetails>
            <ns:PasswordHash>80cde345a3a2b2703d72af08378b080c074f4a3412050ce2ccc3e07208053220</ns:PasswordHash>
            <!--Optional:-->
            <ns:RememberMe>false</ns:RememberMe>
            <ns:UserName>josephtesta09</ns:UserName>
         </ns:request>
      </ns:Login>
   </soapenv:Body>
</soapenv:Envelope>